# Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
df=pd.read_html("https://www.espncricinfo.com/records/team/team-lowest-match-aggregates/india-6/test-matches-1")

In [3]:
df

[         Team 1       Team 2  Runs  Wkts    Overs    RR      Ground  \
 0         India      England   387    30    140.2  2.75   Ahmedabad
 1       England        India   482    31    201.5  2.38      Lord's
 2       England        India   487    29    202.1  2.40  Manchester
 3   New Zealand        India   507    36    176.5  2.86    Hamilton
 4     Australia        India   538    28  186.2x8  2.16    Brisbane
 ..          ...          ...   ...   ...      ...   ...         ...
 95        India  West Indies   825    30    256.3  3.21      Kanpur
 96        India  West Indies   826    40    293.0  2.81   Ahmedabad
 97        India  New Zealand   830    37    264.3  3.13    Wankhede
 98        India    Australia   835    33    326.3  2.55       Delhi
 99  West Indies        India   838    40    285.3  2.93  Bridgetown

      Match Date    Scorecard
 0   24 Feb 2021  Test # 2412
 1   27 Jun 1936   Test # 252
 2   17 Jul 1952   Test # 353
 3   19 Dec 2002  Test # 1633
 4   28 Nov 1947   Test # 290
 ..          ...          ...
 95  21 Oct 1983   Test # 964
 96  12 Nov 1983   Test # 967
 97   3 Dec 2021  Test # 2438
 98  10 Oct 1996  Test # 1335
 99  27 Mar 1997  Test # 1363

 [100 rows x 9 columns]]

In [4]:
type(df)

list

In [5]:
url_data=df[0]

In [6]:
url_data

,Team 1,Team 2,Runs,Wkts,Overs,RR,Ground,Match Date,Scorecard
0,India,England,387,30,140.2,2.75,Ahmedabad,24 Feb 2021,Test # 2412
1,England,India,482,31,201.5,2.38,Lord's,27 Jun 1936,Test # 252
2,England,India,487,29,202.1,2.40,Manchester,17 Jul 1952,Test # 353
3,New Zealand,India,507,36,176.5,2.86,Hamilton,19 Dec 2002,Test # 1633
4,Australia,India,538,28,186.2x8,2.16,Brisbane,28 Nov 1947,Test # 290
...,...,...,...,...,...,...,...,...,...
95,India,West Indies,825,30,256.3,3.21,Kanpur,21 Oct 1983,Test # 964
96,India,West Indies,826,40,293.0,2.81,Ahmedabad,12 Nov 1983,Test # 967
97,India,New Zealand,830,37,264.3,3.13,Wankhede,3 Dec 2021,Test # 2438
98,India,Australia,835,33,326.3,2.55,Delhi,10 Oct 1996,Test # 1335
99,West Indies,India,838,40,285.3,2.93,Bridgetown,27 Mar 1997,Test # 1363

In [7]:
url_data.dtypes

Team 1         object
Team 2         object
Runs            int64
Wkts            int64
Overs          object
RR            float64
Ground         object
Match Date     object
Scorecard      object
dtype: object

In [8]:
url_data.describe()

             Runs        Wkts          RR
count  100.000000  100.000000  100.000000
mean   721.710000   32.610000    2.714000
std     91.665983    4.437888    0.486328
min    387.000000   21.000000    1.870000
25%    673.750000   30.000000    2.335000
50%    752.000000   30.000000    2.675000
75%    792.250000   36.000000    2.950000
max    838.000000   40.000000    4.010000

In [9]:
url_data.head()

,Team 1,Team 2,Runs,Wkts,Overs,RR,Ground,Match Date,Scorecard
0,India,England,387,30,140.2,2.75,Ahmedabad,24 Feb 2021,Test # 2412
1,England,India,482,31,201.5,2.38,Lord's,27 Jun 1936,Test # 252
2,England,India,487,29,202.1,2.40,Manchester,17 Jul 1952,Test # 353
3,New Zealand,India,507,36,176.5,2.86,Hamilton,19 Dec 2002,Test # 1633
4,Australia,India,538,28,186.2x8,2.16,Brisbane,28 Nov 1947,Test # 290

In [10]:
url_data.tail()

,Team 1,Team 2,Runs,Wkts,Overs,RR,Ground,Match Date,Scorecard
95,India,West Indies,825,30,256.3,3.21,Kanpur,21 Oct 1983,Test # 964
96,India,West Indies,826,40,293.0,2.81,Ahmedabad,12 Nov 1983,Test # 967
97,India,New Zealand,830,37,264.3,3.13,Wankhede,3 Dec 2021,Test # 2438
98,India,Australia,835,33,326.3,2.55,Delhi,10 Oct 1996,Test # 1335
99,West Indies,India,838,40,285.3,2.93,Bridgetown,27 Mar 1997,Test # 1363

In [11]:
url_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Team 1      100 non-null    object
 1   Team 2      100 non-null    object
 2   Runs        100 non-null    int64
 3   Wkts        100 non-null    int64
 4   Overs       100 non-null    object
 5   RR          100 non-null    float64
 6   Ground      100 non-null    object
 7   Match Date  100 non-null    object
 8   Scorecard   100 non-null    object
dtypes: float64(1), int64(2), object(6)
memory usage: 7.2+ KB

In [12]:
url_data.isnull()

    Team 1  Team 2   Runs   Wkts  Overs     RR  Ground  Match Date  Scorecard
0    False   False  False  False  False  False   False       False      False
1    False   False  False  False  False  False   False       False      False
2    False   False  False  False  False  False   False       False      False
3    False   False  False  False  False  False   False       False      False
4    False   False  False  False  False  False   False       False      False
..     ...     ...    ...    ...    ...    ...     ...         ...        ...
95   False   False  False  False  False  False   False       False      False
96   False   False  False  False  False  False   False       False      False
97   False   False  False  False  False  False   False       False      False
98   False   False  False  False  False  False   False       False      False
99   False   False  False  False  False  False   False       False      False

[100 rows x 9 columns]

In [13]:
url_data.isnull().sum()

Team 1        0
Team 2        0
Runs          0
Wkts          0
Overs         0
RR            0
Ground        0
Match Date    0
Scorecard     0
dtype: int64

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row

In [14]:
data2=[("Sachin","HCL",25000),("Deepak","INFOSYS",24000),("Rohit","Wipro",30000)]

In [15]:
df2=pd.DataFrame(data2,columns=("A","B","C"))

In [16]:
df2

        A        B      C
0  Sachin      HCL  25000
1  Deepak  INFOSYS  24000
2   Rohit    Wipro  30000

In [17]:
s=pd.Series([1,3,5])

In [18]:
df2.set_index(s)

        A        B      C
1  Sachin      HCL  25000
3  Deepak  INFOSYS  24000
5   Rohit    Wipro  30000

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [19]:
df4=pd.DataFrame([10,20,30,40,50],columns=["Values"])

In [20]:
df4

   Values
0      10
1      20
2      30
3      40
4      50

In [21]:
df4["Values"].head(3).sum()

60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [22]:
df5=pd.DataFrame(["Royal Challengers Bangalore","Mumbai Indians","Chennai Super Kings","Gujrat Titans","Punjab Kings","Sunrisers Hyderabad",
                 "Lucknow Super Giants","Delhi Capitals","Rajastan Royals","Kolkata Knight Riders"],columns=["Text"])

In [23]:
df5

                          Text
0  Royal Challengers Bangalore
1               Mumbai Indians
2          Chennai Super Kings
3                Gujrat Titans
4                 Punjab Kings
5          Sunrisers Hyderabad
6         Lucknow Super Giants
7               Delhi Capitals
8              Rajastan Royals
9        Kolkata Knight Riders

In [24]:
df5["Word_count"]=df5["Text"].apply(lambda x:len(x.split()))

In [25]:
df5

                          Text  Word_count
0  Royal Challengers Bangalore           3
1               Mumbai Indians           2
2          Chennai Super Kings           3
3                Gujrat Titans           2
4                 Punjab Kings           2
5          Sunrisers Hyderabad           2
6         Lucknow Super Giants           3
7               Delhi Capitals           2
8              Rajastan Royals           2
9        Kolkata Knight Riders           3

# Q5. How are DataFrame.size() and DataFrame.shape() different?

Size of a dataframe is the number of fields in the dataframe which is nothing but number of rows * number of columns

In [26]:
df5.size

20

Shape of a dataframe gets the number of rows and number of columns of the dataframe.

In [27]:
df5.shape

(10, 2)

# Q6. Which function of pandas do we use to read an excel file?

We use the "read_excel"  function to read the excel file

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address

### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column

In [28]:
df8=pd.DataFrame(["john@gmail.com","Abhishek@gmail.com","Rohit123@gmail.com","Samyak89@gmail.com"],columns=["Email"])

In [29]:
df8

                Email
0      john@gmail.com
1  Abhishek@gmail.com
2  Rohit123@gmail.com
3  Samyak89@gmail.com

In [30]:
df8["Username"]=df8.Email.str.split('@').str[0]

In [31]:
df8

                Email  Username
0      john@gmail.com      john
1  Abhishek@gmail.com  Abhishek
2  Rohit123@gmail.com  Rohit123
3  Samyak89@gmail.com  Samyak89

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows

In [32]:
df9=pd.DataFrame([(3,5,1),(8,2,7),(6,9,4),(2,3,5),(9,1,2)],columns=("A","B","C"))

In [33]:
df9

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [34]:
 df01=df9[(df9.A>5) & (df9.B<10)]

In [35]:
df01

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [36]:
df4

   Values
0      10
1      20
2      30
3      40
4      50

In [37]:
df4.describe()

          Values
count   5.000000
mean   30.000000
std    15.811388
min    10.000000
25%    20.000000
50%    30.000000
75%    40.000000
max    50.000000

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day

In [38]:
df11 = pd.DataFrame({'Date': ['2023-05-01', '2023-05-02', '2023-05-03','2023-05-04','2023-05-05','2023-05-06','2023-05-07','2023-05-08',
                              '2023-05-09','2023-05-10'], 'sales': [100, 200, 300,400,500,600,700,800,900,1000]})

In [39]:
df11

         Date  sales
0  2023-05-01    100
1  2023-05-02    200
2  2023-05-03    300
3  2023-05-04    400
4  2023-05-05    500
5  2023-05-06    600
6  2023-05-07    700
7  2023-05-08    800
8  2023-05-09    900
9  2023-05-10   1000

In [40]:
df11["Moving Average"]=df11.rolling(window=7).mean()

In [41]:
df11

         Date  sales  Moving Average
0  2023-05-01    100             NaN
1  2023-05-02    200             NaN
2  2023-05-03    300             NaN
3  2023-05-04    400             NaN
4  2023-05-05    500             NaN
5  2023-05-06    600             NaN
6  2023-05-07    700           400.0
7  2023-05-08    800           500.0
8  2023-05-09    900           600.0
9  2023-05-10   1000           700.0

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [42]:
df10=pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06','2023-06-06']})

In [43]:
df10

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-06-06

In [44]:
df10['Date'] = pd.to_datetime(df10['Date'])

In [45]:
import datetime as dt

In [46]:
df10['Weekday']=df10.Date.dt.day_name()

In [47]:
df10

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday
6 2023-06-06    Tuesday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [48]:
df13=pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06','2023-02-06',
                           '2023-03-06','2023-04-06','2023-04-06','2023-03-06','2023-04-06','2023-06-06']})

In [49]:
df13

          Date
0   2023-01-01
1   2023-01-02
2   2023-01-03
3   2023-01-04
4   2023-01-05
5   2023-01-06
6   2023-02-06
7   2023-03-06
8   2023-04-06
9   2023-04-06
10  2023-03-06
11  2023-04-06
12  2023-06-06

In [50]:
filtered_df13=df13.loc[(df13['Date']>='2023-01-01')&(df13['Date']<='2023-01-31')]

In [51]:
filtered_df13

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported

"PANDAS" LIBRARY